Metodo muito util que vem do sql, muito importante

In [58]:
import pandas as pd 

data = {'Classe': ['Junior','Junior','Pleno','Pleno','Senior','Senior'],
        'Nome': ['João','Jorge','Clarisse','Carla','keplin','Carlos'],
        'Venda': [200,120,340,253,350,128]}

In [59]:
df = pd.DataFrame(data)
df

   Classe      Nome  Venda
0  Junior      João    200
1  Junior     Jorge    120
2   Pleno  Clarisse    340
3   Pleno     Carla    253
4  Senior    keplin    350
5  Senior    Carlos    128

Utilizamos quando temos dataframes muito grandes, com muitas aparições de mesmas pessoas ou classes, é basicamente agrupar e fazer operação por meio de certa operação

In [60]:
group = df.groupby("Classe")['Venda']

In [61]:
group.sum()

Classe
Junior    320
Pleno     593
Senior    478
Name: Venda, dtype: int64

In [62]:
group.mean().reset_index() ##reset_index serve para que o indice seja numerico de volta,usado em poucos casos

   Classe  Venda
0  Junior  160.0
1   Pleno  296.5
2  Senior  239.0

In [63]:
df.groupby('Classe').max()

            Nome  Venda
Classe
Junior      João    200
Pleno   Clarisse    340
Senior    keplin    350

Tome cuidado com os ponteiros da memoria, logo abaixo é possivel ver que ao mudar o valor de vendas de uma copia do df, que nomeamos de df2,mudando os valores das vendas, os valores da vendas de df mudaram tambem, ou seja df2 não é uma copia de df, mas sim uma referencia de memoria em que o df tambme aponta, tanto o df quanto o df2 apontam para mesma referencia de memoria

In [64]:
# df2 = df

In [65]:
# df2["Venda"] = [150,430,190,230,410,155]

# df2#

In [66]:
# df

para que voce tenha valores de copias independentes use o metodo .copy()

In [67]:
df2 = df.copy()

df2["Venda"] = [150,430,190,230,410,155]
df2

   Classe      Nome  Venda
0  Junior      João    150
1  Junior     Jorge    430
2   Pleno  Clarisse    190
3   Pleno     Carla    230
4  Senior    keplin    410
5  Senior    Carlos    155

In [68]:
df

   Classe      Nome  Venda
0  Junior      João    200
1  Junior     Jorge    120
2   Pleno  Clarisse    340
3   Pleno     Carla    253
4  Senior    keplin    350
5  Senior    Carlos    128